# Data Visualization with Modern Data Science

> Data Wrangling with Pandas

Yao-Jen Kuo <yaojenkuo@ntu.edu.tw> from [DATAINPOINT](https://www.datainpoint.com/)

In [1]:
from datetime import date
from datetime import timedelta
import urllib.error
import re
import pandas as pd

## Basic attributes and methods

In [2]:
def get_latest_daily_report():
    data_date = date.today()
    day_delta = timedelta(days=1)
    while True:
        data_date_str = date.strftime(data_date, '%m-%d-%Y')
        print("Try importing {} data...".format(data_date_str))
        daily_report_url = "https://raw.githubusercontent.com\
/CSSEGISandData/COVID-19/master\
/csse_covid_19_data/csse_covid_19_daily_reports/{}.csv".format(data_date_str)
        try:
            daily_report = pd.read_csv(daily_report_url)
            print("Successfully imported {} data!".format(data_date_str))
            break
        except urllib.error.HTTPError:
            data_date -= day_delta
    return daily_report

In [3]:
daily_report = get_latest_daily_report()

Try importing 05-04-2022 data...
Try importing 05-03-2022 data...
Successfully imported 05-03-2022 data!

## Basic attributes of a `DataFrame` object

- `shape`
- `dtypes`
- `index`
- `columns`

In [4]:
print(daily_report.shape)
print(daily_report.dtypes)
print(daily_report.index)
print(daily_report.columns)

(4010, 14)
FIPS                   float64
Admin2                  object
Province_State          object
Country_Region          object
Last_Update             object
Lat                    float64
Long_                  float64
Confirmed                int64
Deaths                   int64
Recovered              float64
Active                 float64
Combined_Key            object
Incident_Rate          float64
Case_Fatality_Ratio    float64
dtype: object
RangeIndex(start=0, stop=4010, step=1)
Index(['FIPS', 'Admin2', 'Province_State', 'Country_Region', 'Last_Update',
       'Lat', 'Long_', 'Confirmed', 'Deaths', 'Recovered', 'Active',
       'Combined_Key', 'Incident_Rate', 'Case_Fatality_Ratio'],
      dtype='object')

## Basic methods of a `DataFrame` object

- `head(n)`
- `tail(n)`
- `describe()`
- `info()`
- `set_index()`
- `reset_index()`

## `head(n)` returns the top n observations with header

In [5]:
daily_report.head() # n is default to 5

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2022-05-04 04:20:59,33.93911,67.709953,178901,7683,NaN,NaN,Afghanistan,459.564922,4.294554
1,NaN,NaN,NaN,Albania,2022-05-04 04:20:59,41.15330,20.168300,275191,3496,NaN,NaN,Albania,9562.547780,1.270390
2,NaN,NaN,NaN,Algeria,2022-05-04 04:20:59,28.03390,1.659600,265782,6875,NaN,NaN,Algeria,606.101889,2.586706
3,NaN,NaN,NaN,Andorra,2022-05-04 04:20:59,42.50630,1.521800,41349,153,NaN,NaN,Andorra,53515.822170,0.370021
4,NaN,NaN,NaN,Angola,2022-05-04 04:20:59,-11.20270,17.873900,99287,1900,NaN,NaN,Angola,302.093928,1.913644

## `tail(n)` returns the bottom n observations with header

In [6]:
daily_report.tail(3)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4007,NaN,NaN,NaN,Yemen,2022-05-04 04:20:59,15.552727,48.516388,11819,2149,NaN,NaN,Yemen,39.626543,18.182587
4008,NaN,NaN,NaN,Zambia,2022-05-04 04:20:59,-13.133897,27.849332,319755,3976,NaN,NaN,Zambia,1739.315521,1.243452
4009,NaN,NaN,NaN,Zimbabwe,2022-05-04 04:20:59,-19.015438,29.154857,247990,5470,NaN,NaN,Zimbabwe,1668.513880,2.205734

## `describe()` returns the descriptive summary for numeric columns

In [7]:
daily_report.describe()

,FIPS,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
count,3268.000000,3920.000000,3920.000000,4.010000e+03,4010.000000,0.0,0.0,3917.000000,3969.000000
mean,32405.943390,35.784501,-71.244792,1.284088e+05,1556.344140,NaN,NaN,22702.432129,2.457078
std,18056.381177,13.356648,55.001332,8.000100e+05,8236.893811,NaN,NaN,10097.040667,54.415844
min,60.000000,-71.949900,-178.116500,0.000000e+00,0.000000,NaN,NaN,0.000000,0.000000
25%,19048.500000,33.204471,-96.584625,2.988250e+03,41.000000,NaN,NaN,18974.007296,0.945830
50%,30068.000000,37.910342,-86.729024,8.479000e+03,117.000000,NaN,NaN,23642.449789,1.399972
75%,47041.500000,42.186227,-77.369826,3.695700e+04,403.750000,NaN,NaN,27376.425856,1.908127
max,99999.000000,71.706900,178.065000,2.797858e+07,168272.000000,NaN,NaN,343404.634581,3426.760563

## `info()` returns the concise information of the dataframe

In [8]:
daily_report.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4010 entries, 0 to 4009
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   FIPS                 3268 non-null   float64
 1   Admin2               3272 non-null   object
 2   Province_State       3834 non-null   object
 3   Country_Region       4010 non-null   object
 4   Last_Update          4010 non-null   object
 5   Lat                  3920 non-null   float64
 6   Long_                3920 non-null   float64
 7   Confirmed            4010 non-null   int64
 8   Deaths               4010 non-null   int64
 9   Recovered            0 non-null      float64
 10  Active               0 non-null      float64
 11  Combined_Key         4010 non-null   object
 12  Incident_Rate        3917 non-null   float64
 13  Case_Fatality_Ratio  3969 non-null   float64
dtypes: float64(7), int64(2), object(5)
memory usage: 438.7+ KB

## `set_index()` replaces current `Index` with a specific variable

In [9]:
daily_report.set_index('Combined_Key')

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
Combined_Key,,,,,,,,,,,,,
Afghanistan,NaN,NaN,NaN,Afghanistan,2022-05-04 04:20:59,33.939110,67.709953,178901,7683,NaN,NaN,459.564922,4.294554
Albania,NaN,NaN,NaN,Albania,2022-05-04 04:20:59,41.153300,20.168300,275191,3496,NaN,NaN,9562.547780,1.270390
Algeria,NaN,NaN,NaN,Algeria,2022-05-04 04:20:59,28.033900,1.659600,265782,6875,NaN,NaN,606.101889,2.586706
Andorra,NaN,NaN,NaN,Andorra,2022-05-04 04:20:59,42.506300,1.521800,41349,153,NaN,NaN,53515.822170,0.370021
Angola,NaN,NaN,NaN,Angola,2022-05-04 04:20:59,-11.202700,17.873900,99287,1900,NaN,NaN,302.093928,1.913644
...,...,...,...,...,...,...,...,...,...,...,...,...,...
West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2022-05-04 04:20:59,31.952200,35.233200,657060,5657,NaN,NaN,12879.953331,0.860956
Winter Olympics 2022,NaN,NaN,NaN,Winter Olympics 2022,2022-05-04 04:20:59,39.904200,116.407400,535,0,NaN,NaN,NaN,0.000000
Yemen,NaN,NaN,NaN,Yemen,2022-05-04 04:20:59,15.552727,48.516388,11819,2149,NaN,NaN,39.626543,18.182587
Zambia,NaN,NaN,NaN,Zambia,2022-05-04 04:20:59,-13.133897,27.849332,319755,3976,NaN,NaN,1739.315521,1.243452
Zimbabwe,NaN,NaN,NaN,Zimbabwe,2022-05-04 04:20:59,-19.015438,29.154857,247990,5470,NaN,NaN,1668.513880,2.205734

## `reset_index()` resets current `Index` with default `RangeIndex`

In [10]:
daily_report.set_index('Combined_Key').reset_index()

,Combined_Key,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
0,Afghanistan,NaN,NaN,NaN,Afghanistan,2022-05-04 04:20:59,33.939110,67.709953,178901,7683,NaN,NaN,459.564922,4.294554
1,Albania,NaN,NaN,NaN,Albania,2022-05-04 04:20:59,41.153300,20.168300,275191,3496,NaN,NaN,9562.547780,1.270390
2,Algeria,NaN,NaN,NaN,Algeria,2022-05-04 04:20:59,28.033900,1.659600,265782,6875,NaN,NaN,606.101889,2.586706
3,Andorra,NaN,NaN,NaN,Andorra,2022-05-04 04:20:59,42.506300,1.521800,41349,153,NaN,NaN,53515.822170,0.370021
4,Angola,NaN,NaN,NaN,Angola,2022-05-04 04:20:59,-11.202700,17.873900,99287,1900,NaN,NaN,302.093928,1.913644
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4005,West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2022-05-04 04:20:59,31.952200,35.233200,657060,5657,NaN,NaN,12879.953331,0.860956
4006,Winter Olympics 2022,NaN,NaN,NaN,Winter Olympics 2022,2022-05-04 04:20:59,39.904200,116.407400,535,0,NaN,NaN,NaN,0.000000
4007,Yemen,NaN,NaN,NaN,Yemen,2022-05-04 04:20:59,15.552727,48.516388,11819,2149,NaN,NaN,39.626543,18.182587
4008,Zambia,NaN,NaN,NaN,Zambia,2022-05-04 04:20:59,-13.133897,27.849332,319755,3976,NaN,NaN,1739.315521,1.243452
4009,Zimbabwe,NaN,NaN,NaN,Zimbabwe,2022-05-04 04:20:59,-19.015438,29.154857,247990,5470,NaN,NaN,1668.513880,2.205734

## Basic Wrangling

## Basic wrangling is like writing SQL queries

- Selecting: `SELECT FROM`
- Filtering: `WHERE`
- Subset: `SELECT FROM WHERE`

## Basic wrangling is like writing SQL queries(cont'd)

- Indexing
- Sorting: `ORDER BY`
- Deriving
- Summarizing
- Summarizing and Grouping: `GROUP BY`

## Selecting a column as `Series`

In [11]:
print(daily_report['Country_Region'])
print(type(daily_report['Country_Region']))

0                Afghanistan
1                    Albania
2                    Algeria
3                    Andorra
4                     Angola
                ...
4005      West Bank and Gaza
4006    Winter Olympics 2022
4007                   Yemen
4008                  Zambia
4009                Zimbabwe
Name: Country_Region, Length: 4010, dtype: object
<class 'pandas.core.series.Series'>

## Selecting a column as `DataFrame`

In [12]:
print(type(daily_report[['Country_Region']]))
daily_report[['Country_Region']]

<class 'pandas.core.frame.DataFrame'>

            Country_Region
0              Afghanistan
1                  Albania
2                  Algeria
3                  Andorra
4                   Angola
...                    ...
4005    West Bank and Gaza
4006  Winter Olympics 2022
4007                 Yemen
4008                Zambia
4009              Zimbabwe

[4010 rows x 1 columns]

## Selecting multiple columns as `DataFrame`, for sure

In [13]:
cols = ['Country_Region', 'Confirmed', 'Deaths']
daily_report[cols]

            Country_Region  Confirmed  Deaths
0              Afghanistan     178901    7683
1                  Albania     275191    3496
2                  Algeria     265782    6875
3                  Andorra      41349     153
4                   Angola      99287    1900
...                    ...        ...     ...
4005    West Bank and Gaza     657060    5657
4006  Winter Olympics 2022        535       0
4007                 Yemen      11819    2149
4008                Zambia     319755    3976
4009              Zimbabwe     247990    5470

[4010 rows x 3 columns]

## Filtering rows with conditional statements

In [14]:
is_taiwan = daily_report['Country_Region'] == 'Taiwan*'
daily_report[is_taiwan]

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
664,NaN,NaN,NaN,Taiwan*,2022-05-04 04:20:59,23.7,121.0,173942,876,NaN,NaN,Taiwan*,730.333977,0.503616

## Subsetting columns and rows simultaneously

In [15]:
cols_to_select = ['Country_Region', 'Confirmed', 'Deaths']
rows_to_filter = daily_report['Country_Region'] == 'Taiwan*'
daily_report[rows_to_filter][cols_to_select]

    Country_Region  Confirmed  Deaths
664        Taiwan*     173942     876

## Indexing `DataFrame` with

- `loc[]`
- `iloc[]`

## `loc[]` is indexing `DataFrame` with `Index`

In [16]:
taiwan_row_index = daily_report[is_taiwan].index[0]
print(daily_report.loc[taiwan_row_index, ['Country_Region', 'Confirmed']]) # as Series
daily_report.loc[[taiwan_row_index], ['Country_Region', 'Confirmed']] # as DataFrame

Country_Region    Taiwan*
Confirmed          173942
Name: 664, dtype: object

    Country_Region  Confirmed
664        Taiwan*     173942

## `iloc[]` is indexing `DataFrame` with absolute position

In [17]:
print(daily_report.iloc[taiwan_row_index, [3, 7]]) # as Series
daily_report.iloc[[taiwan_row_index], [3, 7]] # as DataFrame

Country_Region    Taiwan*
Confirmed          173942
Name: 664, dtype: object

    Country_Region  Confirmed
664        Taiwan*     173942

## Sorting `DataFrame` with

- `sort_values`
- `sort_index`

## `sort_values` sorts `DataFrame` with specific columns

In [18]:
daily_report.sort_values(['Country_Region', 'Confirmed'])

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2022-05-04 04:20:59,33.939110,67.709953,178901,7683,NaN,NaN,Afghanistan,459.564922,4.294554
1,NaN,NaN,NaN,Albania,2022-05-04 04:20:59,41.153300,20.168300,275191,3496,NaN,NaN,Albania,9562.547780,1.270390
2,NaN,NaN,NaN,Algeria,2022-05-04 04:20:59,28.033900,1.659600,265782,6875,NaN,NaN,Algeria,606.101889,2.586706
3,NaN,NaN,NaN,Andorra,2022-05-04 04:20:59,42.506300,1.521800,41349,153,NaN,NaN,Andorra,53515.822170,0.370021
4,NaN,NaN,NaN,Angola,2022-05-04 04:20:59,-11.202700,17.873900,99287,1900,NaN,NaN,Angola,302.093928,1.913644
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4005,NaN,NaN,NaN,West Bank and Gaza,2022-05-04 04:20:59,31.952200,35.233200,657060,5657,NaN,NaN,West Bank and Gaza,12879.953331,0.860956
4006,NaN,NaN,NaN,Winter Olympics 2022,2022-05-04 04:20:59,39.904200,116.407400,535,0,NaN,NaN,Winter Olympics 2022,NaN,0.000000
4007,NaN,NaN,NaN,Yemen,2022-05-04 04:20:59,15.552727,48.516388,11819,2149,NaN,NaN,Yemen,39.626543,18.182587
4008,NaN,NaN,NaN,Zambia,2022-05-04 04:20:59,-13.133897,27.849332,319755,3976,NaN,NaN,Zambia,1739.315521,1.243452
4009,NaN,NaN,NaN,Zimbabwe,2022-05-04 04:20:59,-19.015438,29.154857,247990,5470,NaN,NaN,Zimbabwe,1668.513880,2.205734

## `sort_index` sorts `DataFrame` with the `Index` of `DataFrame`

In [19]:
daily_report.sort_index(ascending=False)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4009,NaN,NaN,NaN,Zimbabwe,2022-05-04 04:20:59,-19.015438,29.154857,247990,5470,NaN,NaN,Zimbabwe,1668.513880,2.205734
4008,NaN,NaN,NaN,Zambia,2022-05-04 04:20:59,-13.133897,27.849332,319755,3976,NaN,NaN,Zambia,1739.315521,1.243452
4007,NaN,NaN,NaN,Yemen,2022-05-04 04:20:59,15.552727,48.516388,11819,2149,NaN,NaN,Yemen,39.626543,18.182587
4006,NaN,NaN,NaN,Winter Olympics 2022,2022-05-04 04:20:59,39.904200,116.407400,535,0,NaN,NaN,Winter Olympics 2022,NaN,0.000000
4005,NaN,NaN,NaN,West Bank and Gaza,2022-05-04 04:20:59,31.952200,35.233200,657060,5657,NaN,NaN,West Bank and Gaza,12879.953331,0.860956
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,NaN,NaN,NaN,Angola,2022-05-04 04:20:59,-11.202700,17.873900,99287,1900,NaN,NaN,Angola,302.093928,1.913644
3,NaN,NaN,NaN,Andorra,2022-05-04 04:20:59,42.506300,1.521800,41349,153,NaN,NaN,Andorra,53515.822170,0.370021
2,NaN,NaN,NaN,Algeria,2022-05-04 04:20:59,28.033900,1.659600,265782,6875,NaN,NaN,Algeria,606.101889,2.586706
1,NaN,NaN,NaN,Albania,2022-05-04 04:20:59,41.153300,20.168300,275191,3496,NaN,NaN,Albania,9562.547780,1.270390
0,NaN,NaN,NaN,Afghanistan,2022-05-04 04:20:59,33.939110,67.709953,178901,7683,NaN,NaN,Afghanistan,459.564922,4.294554

## Deriving new variables from `DataFrame`

- Simple operations
- `map` with a `dict`
- `map` with a function(or a lambda expression)

## Deriving new variable with simple operations

In [20]:
case_fatality_ratio = daily_report['Deaths'] / daily_report['Confirmed']
case_fatality_ratio

0       0.042946
1       0.012704
2       0.025867
3       0.003700
4       0.019136
          ...
4005    0.008610
4006    0.000000
4007    0.181826
4008    0.012435
4009    0.022057
Length: 4010, dtype: float64

## Deriving categorical from categorical with `map`

- Passing a `dict`
- Passing a function(or lambda expression)

In [21]:
# Passing a dict
country_name = {
    'Taiwan*': 'Taiwan'
}
daily_report_tw = daily_report[is_taiwan]
daily_report_tw['Country_Region'].map(country_name)

664    Taiwan
Name: Country_Region, dtype: object

In [22]:
# Passing a function
def replace_asterisk(x):
    if "*" in x:
        return x.replace("*", "")
    else:
        return x

daily_report['Country_Region'].map(replace_asterisk)[taiwan_row_index]

'Taiwan'

In [23]:
# Passing a lambda expression)
daily_report['Country_Region'].map(lambda x: x.replace("*", "") if "*" in x else x)[taiwan_row_index]

'Taiwan'

## Summarizing `DataFrame` with aggregate methods

In [24]:
daily_report['Confirmed'].sum()

514919478

## Summarizing and grouping `DataFrame` with aggregate methods

In [25]:
daily_report.groupby('Country_Region')['Confirmed'].sum()

Country_Region
Afghanistan             178901
Albania                 275191
Algeria                 265782
Andorra                  41349
Angola                   99287
                         ...
West Bank and Gaza      657060
Winter Olympics 2022       535
Yemen                    11819
Zambia                  319755
Zimbabwe                247990
Name: Confirmed, Length: 198, dtype: int64

## Advanced Wrangling

## Other common wranglings including

- Dealing with missing values.
- Dealing with text values.
- Reshaping dataframes.
- Concatenating, merging and joining dataframes.

## Dealing with missing values

- Using `isnull` or `notnull` to check if `np.nan` exists.
- Using `dropna` to drop rows with `np.nan`.
- Using `fillna` to fill `np.nan` with specific values.

In [26]:
print(daily_report['Province_State'].size)
print(daily_report['Province_State'].isnull().sum())
print(daily_report['Province_State'].notnull().sum())

4010
176
3834

In [27]:
print(daily_report.dropna().shape)
print(daily_report['FIPS'].fillna(0))

(0, 14)
0       0.0
1       0.0
2       0.0
3       0.0
4       0.0
       ...
4005    0.0
4006    0.0
4007    0.0
4008    0.0
4009    0.0
Name: FIPS, Length: 4010, dtype: float64

## Summarizing text columns

- `unique`
- `nunique`
- `value_counts`

In [28]:
print(daily_report['Country_Region'].nunique())
print(daily_report['Country_Region'].unique())

198
['Afghanistan' 'Albania' 'Algeria' 'Andorra' 'Angola' 'Antarctica'
 'Antigua and Barbuda' 'Argentina' 'Armenia' 'Australia' 'Austria'
 'Azerbaijan' 'Bahamas' 'Bahrain' 'Bangladesh' 'Barbados' 'Belarus'
 'Belgium' 'Belize' 'Benin' 'Bhutan' 'Bolivia' 'Bosnia and Herzegovina'
 'Botswana' 'Brazil' 'Brunei' 'Bulgaria' 'Burkina Faso' 'Burma' 'Burundi'
 'Cabo Verde' 'Cambodia' 'Cameroon' 'Canada' 'Central African Republic'
 'Chad' 'Chile' 'China' 'Colombia' 'Comoros' 'Congo (Brazzaville)'
 'Congo (Kinshasa)' 'Costa Rica' "Cote d'Ivoire" 'Croatia' 'Cuba' 'Cyprus'
 'Czechia' 'Denmark' 'Diamond Princess' 'Djibouti' 'Dominica'
 'Dominican Republic' 'Ecuador' 'Egypt' 'El Salvador' 'Equatorial Guinea'
 'Eritrea' 'Estonia' 'Eswatini' 'Ethiopia' 'Fiji' 'Finland' 'France'
 'Gabon' 'Gambia' 'Georgia' 'Germany' 'Ghana' 'Greece' 'Grenada'
 'Guatemala' 'Guinea' 'Guinea-Bissau' 'Guyana' 'Haiti' 'Holy See'
 'Honduras' 'Hungary' 'Iceland' 'India' 'Indonesia' 'Iran' 'Iraq'
 'Ireland' 'Israel' 'Italy' 'Jamaica' 'Japan' 'Jordan' 'Kazakhstan'
 'Kenya' 'Kiribati' 'Korea, South' 'Kosovo' 'Kuwait' 'Kyrgyzstan' 'Laos'
 'Latvia' 'Lebanon' 'Lesotho' 'Liberia' 'Libya' 'Liechtenstein'
 'Lithuania' 'Luxembourg' 'MS Zaandam' 'Madagascar' 'Malawi' 'Malaysia'
 'Maldives' 'Mali' 'Malta' 'Marshall Islands' 'Mauritania' 'Mauritius'
 'Mexico' 'Micronesia' 'Moldova' 'Monaco' 'Mongolia' 'Montenegro'
 'Morocco' 'Mozambique' 'Namibia' 'Nepal' 'Netherlands' 'New Zealand'
 'Nicaragua' 'Niger' 'Nigeria' 'North Macedonia' 'Norway' 'Oman'
 'Pakistan' 'Palau' 'Panama' 'Papua New Guinea' 'Paraguay' 'Peru'
 'Philippines' 'Poland' 'Portugal' 'Qatar' 'Romania' 'Russia' 'Rwanda'
 'Saint Kitts and Nevis' 'Saint Lucia' 'Saint Vincent and the Grenadines'
 'Samoa' 'San Marino' 'Sao Tome and Principe' 'Saudi Arabia' 'Senegal'
 'Serbia' 'Seychelles' 'Sierra Leone' 'Singapore' 'Slovakia' 'Slovenia'
 'Solomon Islands' 'Somalia' 'South Africa' 'South Sudan' 'Spain'
 'Sri Lanka' 'Sudan' 'Summer Olympics 2020' 'Suriname' 'Sweden'
 'Switzerland' 'Syria' 'Taiwan*' 'Tajikistan' 'Tanzania' 'Thailand'
 'Timor-Leste' 'Togo' 'Tonga' 'Trinidad and Tobago' 'Tunisia' 'Turkey'
 'US' 'Uganda' 'Ukraine' 'United Arab Emirates' 'United Kingdom' 'Uruguay'
 'Uzbekistan' 'Vanuatu' 'Venezuela' 'Vietnam' 'West Bank and Gaza'
 'Winter Olympics 2022' 'Yemen' 'Zambia' 'Zimbabwe']

In [29]:
daily_report['Country_Region'].value_counts()

US          3279
Russia        83
Japan         49
India         37
China         34
            ...
Guyana         1
Haiti          1
Holy See       1
Honduras       1
Zimbabwe       1
Name: Country_Region, Length: 198, dtype: int64

## Splitting strings with `str.split` as a `Series`

In [30]:
request_url = "https://www.imdb.com/chart/top"
html_tables = pd.read_html(request_url)
html_table = html_tables[0]
html_table.head()

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. 刺激1995 (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. 教父 (1972),9.2,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. 黑暗騎士 (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. 教父第二集 (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. 十二怒漢 (1957),8.9,12345678910 NOT YET RELEASED Seen,NaN

In [31]:
html_table['Rank & Title'].str.split()

0       [1., 刺激1995, (1994)]
1           [2., 教父, (1972)]
2         [3., 黑暗騎士, (2008)]
3        [4., 教父第二集, (1974)]
4         [5., 十二怒漢, (1957)]
               ...
245      [246., 阿拉丁, (1992)]
246       [247., 姊妹, (2011)]
247    [248., 美女與野獸, (1991)]
248    [249., 男人的爭鬥, (1955)]
249     [250., 與狼共舞, (1990)]
Name: Rank & Title, Length: 250, dtype: object

## Splitting strings with `str.split` as a `DataFrame`

In [32]:
html_table['Rank & Title'].str.split(expand=True)

        0       1       2
0      1.  刺激1995  (1994)
1      2.      教父  (1972)
2      3.    黑暗騎士  (2008)
3      4.   教父第二集  (1974)
4      5.    十二怒漢  (1957)
..    ...     ...     ...
245  246.     阿拉丁  (1992)
246  247.      姊妹  (2011)
247  248.   美女與野獸  (1991)
248  249.   男人的爭鬥  (1955)
249  250.    與狼共舞  (1990)

[250 rows x 3 columns]

## Replacing strings with `str.replace`

In [33]:
split_dataframe = html_table['Rank & Title'].str.split(expand=True)
ranks = split_dataframe[0].str.replace(".", '', regex=False)
ranks

0        1
1        2
2        3
3        4
4        5
      ...
245    246
246    247
247    248
248    249
249    250
Name: 0, Length: 250, dtype: object

In [34]:
split_dataframe = html_table['Rank & Title'].str.split(expand=True)
years = split_dataframe[2].str.replace("\(|\)", '', regex=True)
years

0      1994
1      1972
2      2008
3      1974
4      1957
       ...
245    1992
246    2011
247    1991
248    1955
249    1990
Name: 2, Length: 250, dtype: object

## Testing for strings that match or contain a pattern with `str.contains`

In [35]:
print(html_table['Rank & Title'].str.contains('魔戒').sum())
html_table[html_table['Rank & Title'].str.contains('魔戒')]

3

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
6,NaN,7. 魔戒三部曲：王者再臨 (2003),8.9,12345678910 NOT YET RELEASED Seen,NaN
8,NaN,9. 魔戒首部曲：魔戒現身 (2001),8.8,12345678910 NOT YET RELEASED Seen,NaN
13,NaN,14. 魔戒二部曲：雙城奇謀 (2002),8.7,12345678910 NOT YET RELEASED Seen,NaN

## Two formats of a table

- Wide: data is presented with each different data variable in a separate column.
- Long: data is presented with one column containing all the values and another column listing the context of the value.

Source: <https://en.wikipedia.org/wiki/Wide_and_narrow_data>

## Wide, or unstacked data

In [36]:
request_url = "https://en.wikipedia.org/wiki/Wide_and_narrow_data"
wide_format = pd.read_html(request_url)[0]
wide_format

  Person  Age  Weight  Height
0    Bob   32     168     180
1  Alice   24     150     175
2  Steve   64     144     165

## Narrow, stacked, or long data

In [37]:
request_url = "https://en.wikipedia.org/wiki/Wide_and_narrow_data"
long_format = pd.read_html(request_url)[1]
long_format

  Person Variable  Value
0    Bob      Age     32
1    Bob   Weight    168
2    Bob   Height    180
3  Alice      Age     24
4  Alice   Weight    150
5  Alice   Height    175
6  Steve      Age     64
7  Steve   Weight    144
8  Steve   Height    165

## Reshaping dataframes from wide to long format with `pd.melt()`

In [38]:
pd.melt(wide_format, 
        id_vars="Person", value_vars=["Age", "Weight", "Height"],
        var_name="Variable", value_name="Value")

  Person Variable  Value
0    Bob      Age     32
1  Alice      Age     24
2  Steve      Age     64
3    Bob   Weight    168
4  Alice   Weight    150
5  Steve   Weight    144
6    Bob   Height    180
7  Alice   Height    175
8  Steve   Height    165

## Reshaping dataframes from long to wide format with `pivot()`

In [39]:
long_format.pivot(index="Person", columns="Variable", values="Value").reset_index().rename_axis(None, axis=1)

  Person  Age  Height  Weight
0  Alice   24     175     150
1    Bob   32     180     168
2  Steve   64     165     144

## A common problem is that a dataset where some of the column names are not names of variables, but values of a variable

In [40]:
ts_confirmed_global_url = "https://raw.githubusercontent.com/CSSEGISandData\
/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series\
/time_series_covid19_confirmed_global.csv"
ts_confirmed_global = pd.read_csv(ts_confirmed_global_url)
ts_confirmed_global

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,4/24/22,4/25/22,4/26/22,4/27/22,4/28/22,4/29/22,4/30/22,5/1/22,5/2/22,5/3/22
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,178689,178745,178769,178809,178850,178873,178879,178899,178901,178901
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,274828,274828,274862,274929,275002,275055,275107,275167,275177,275191
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,265767,265771,265772,265773,265776,265779,265780,265782,265782,265782
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,41013,41013,41013,41013,41349,41349,41349,41349,41349,41349
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,99287,99287,99287,99287,99287,99287,99287,99287,99287,99287
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
279,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,656876,656876,657060,657060,657060,657060,657060,657060,657060,657060
280,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,535,535,535,535,535,535,535,535,535,535
281,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,11818,11818,11818,11818,11818,11818,11818,11818,11819,11819
282,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,318984,319316,319431,319431,319594,319594,319594,319733,319755,319755
283,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,247524,247598,247667,247729,247784,247842,247875,247911,247935,247990

## We can pivot the columns into a new pair of variables

To describe that operation we need four parameters:

- The set of columns whose names are not values
- The set of columns whose names are values
- The name of the variable to move the column names to
- The name of the variable to move the column values to

## In this example, the four parameters are

- `id_vars`: `['Province/State', 'Country/Region', 'Lat', 'Long']`
- `value_vars`: The columns from `1/22/20` to the last column
- `var_name`: Let's name it `Date`
- `value_name`: Let's name it `Confirmed`

In [41]:
idVars = ['Province/State', 'Country/Region', 'Lat', 'Long']
ts_confirmed_global_long = pd.melt(ts_confirmed_global,
                                   id_vars=idVars,
                                   var_name='Date',
                                   value_name='Confirmed')
ts_confirmed_global_long

,Province/State,Country/Region,Lat,Long,Date,Confirmed
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
236567,NaN,West Bank and Gaza,31.952200,35.233200,5/3/22,657060
236568,NaN,Winter Olympics 2022,39.904200,116.407400,5/3/22,535
236569,NaN,Yemen,15.552727,48.516388,5/3/22,11819
236570,NaN,Zambia,-13.133897,27.849332,5/3/22,319755
236571,NaN,Zimbabwe,-19.015438,29.154857,5/3/22,247990

## Concatenating, merging and joining dataframes

- `concat()` vertically or horizontally.
- `merge()` horizontally on column names.
- `join()` horizontally on index.

In [42]:
def get_top_rated_movies():
    request_url = "https://www.imdb.com/chart/top"
    html_tables = pd.read_html(request_url)
    html_table = html_tables[0]
    split_dataframe = html_table['Rank & Title'].str.split(expand=True)
    ranks = split_dataframe[0].str.replace(".", '', regex=False).values
    split_series = html_table['Rank & Title'].str.split()
    years, titles = list(), list()
    for lst in split_series:
        year = re.sub("\(|\)", '', lst[-1])
        title = " ".join(lst[1:-1])
        years.append(int(year))
        titles.append(title)
    ratings = html_table['IMDb Rating'].values
    out = pd.DataFrame()
    out['rank'] = ranks
    out['title'] = titles
    out['year'] = years
    out['rating'] = ratings
    return out

top_rated_movies = get_top_rated_movies()

In [43]:
batman_trilogy = top_rated_movies[top_rated_movies["title"].str.contains("蝙蝠俠|黑暗騎士", regex=True)]
batman_trilogy

    rank      title  year  rating
2      3       黑暗騎士  2008     9.0
68    69  黑暗騎士：黎明昇起  2012     8.3
126  127   蝙蝠俠：開戰時刻  2005     8.2

In [44]:
lord_of_the_rings_trilogy = top_rated_movies[top_rated_movies["title"].str.contains("魔戒", regex=False)]
lord_of_the_rings_trilogy

   rank       title  year  rating
6     7  魔戒三部曲：王者再臨  2003     8.9
8     9  魔戒首部曲：魔戒現身  2001     8.8
13   14  魔戒二部曲：雙城奇謀  2002     8.7

## Use `concat()` function to concatenate vertically or horizontally

In [45]:
pd.concat((batman_trilogy, lord_of_the_rings_trilogy))

    rank       title  year  rating
2      3        黑暗騎士  2008     9.0
68    69   黑暗騎士：黎明昇起  2012     8.3
126  127    蝙蝠俠：開戰時刻  2005     8.2
6      7  魔戒三部曲：王者再臨  2003     8.9
8      9  魔戒首部曲：魔戒現身  2001     8.8
13    14  魔戒二部曲：雙城奇謀  2002     8.7

In [46]:
pd.concat((batman_trilogy["title"], lord_of_the_rings_trilogy["title"]), axis=1)

         title       title
2         黑暗騎士         NaN
68   黑暗騎士：黎明昇起         NaN
126   蝙蝠俠：開戰時刻         NaN
6          NaN  魔戒三部曲：王者再臨
8          NaN  魔戒首部曲：魔戒現身
13         NaN  魔戒二部曲：雙城奇謀

In [47]:
pd.concat((batman_trilogy["title"].reset_index(drop=True),
           lord_of_the_rings_trilogy["title"].reset_index(drop=True)),
          axis=1)

       title       title
0       黑暗騎士  魔戒三部曲：王者再臨
1  黑暗騎士：黎明昇起  魔戒首部曲：魔戒現身
2   蝙蝠俠：開戰時刻  魔戒二部曲：雙城奇謀

In [48]:
left_df = top_rated_movies.loc[:9, ['title', 'year']]
right_df = top_rated_movies[top_rated_movies['title'].str.contains('魔戒')][['title', 'rating']].reset_index(drop=True)
left_df

        title  year
0      刺激1995  1994
1          教父  1972
2        黑暗騎士  2008
3       教父第二集  1974
4        十二怒漢  1957
5      辛德勒的名單  1993
6  魔戒三部曲：王者再臨  2003
7       黑色追緝令  1994
8  魔戒首部曲：魔戒現身  2001
9       黃昏三鏢客  1966

In [49]:
right_df

        title  rating
0  魔戒三部曲：王者再臨     8.9
1  魔戒首部曲：魔戒現身     8.8
2  魔戒二部曲：雙城奇謀     8.7

## Using `merge` function to join dataframes on columns

In [50]:
# default: inner join
pd.merge(left_df, right_df)

        title  year  rating
0  魔戒三部曲：王者再臨  2003     8.9
1  魔戒首部曲：魔戒現身  2001     8.8

In [51]:
# left join
pd.merge(left_df, right_df, how='left')

        title  year  rating
0      刺激1995  1994     NaN
1          教父  1972     NaN
2        黑暗騎士  2008     NaN
3       教父第二集  1974     NaN
4        十二怒漢  1957     NaN
5      辛德勒的名單  1993     NaN
6  魔戒三部曲：王者再臨  2003     8.9
7       黑色追緝令  1994     NaN
8  魔戒首部曲：魔戒現身  2001     8.8
9       黃昏三鏢客  1966     NaN

In [52]:
# right join
pd.merge(left_df, right_df, how='right')

        title    year  rating
0  魔戒三部曲：王者再臨  2003.0     8.9
1  魔戒首部曲：魔戒現身  2001.0     8.8
2  魔戒二部曲：雙城奇謀     NaN     8.7

## Using `join` method to join dataframes on index

In [53]:
# join dataframes on index
left_df.join(right_df, lsuffix='_x', rsuffix='_y')

      title_x  year     title_y  rating
0      刺激1995  1994  魔戒三部曲：王者再臨     8.9
1          教父  1972  魔戒首部曲：魔戒現身     8.8
2        黑暗騎士  2008  魔戒二部曲：雙城奇謀     8.7
3       教父第二集  1974         NaN     NaN
4        十二怒漢  1957         NaN     NaN
5      辛德勒的名單  1993         NaN     NaN
6  魔戒三部曲：王者再臨  2003         NaN     NaN
7       黑色追緝令  1994         NaN     NaN
8  魔戒首部曲：魔戒現身  2001         NaN     NaN
9       黃昏三鏢客  1966         NaN     NaN

In [54]:
left_df = left_df.set_index('title')
right_df = right_df.set_index('title')
# default: left join
left_df.join(right_df)

            year  rating
title
刺激1995      1994     NaN
教父          1972     NaN
黑暗騎士        2008     NaN
教父第二集       1974     NaN
十二怒漢        1957     NaN
辛德勒的名單      1993     NaN
魔戒三部曲：王者再臨  2003     8.9
黑色追緝令       1994     NaN
魔戒首部曲：魔戒現身  2001     8.8
黃昏三鏢客       1966     NaN

In [55]:
# inner join
left_df.join(right_df, how='inner')

            year  rating
title
魔戒三部曲：王者再臨  2003     8.9
魔戒首部曲：魔戒現身  2001     8.8

In [56]:
# right join
left_df.join(right_df, how='right')

              year  rating
title
魔戒三部曲：王者再臨  2003.0     8.9
魔戒首部曲：魔戒現身  2001.0     8.8
魔戒二部曲：雙城奇謀     NaN     8.7